# IsRecommendedTypeForSet Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AlignmentStationLabel..::..IsRecommendedTypeForSet Method
AlignmentStationLabel Class See Also
---
Checks if the element type is recommended for alignment labels in sets.
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public static bool IsRecommendedTypeForSet(
	Element type
)
```

Visual Basic
---
```text
Public Shared Function IsRecommendedTypeForSet ( _
	type As Element _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsRecommendedTypeForSet(
	Element^ type
)
```

# ### Parameters
type
    Type: Autodesk.Revit.DB..::..ElementThe type element to check.
# Remarks
Can be used for finding types to be set to TypeId when creating alignment label sets with CreateSet(Alignment, View, AlignmentStationLabelSetOptions).
# See Also
AlignmentStationLabel Class
Autodesk.Revit.DB.Infrastructure Namespace